OCEDT461/src/Documents/ПриходТовара/ПриходТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходТовара</name>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

OCEDT461/src/Documents/ПриходТовара/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
ТекДанные = Элементы.Товары.ТекущиеДанные;
ТекстСообщения = "Изменено количество";



ПересчитатьСумму(ТекДанные, ТекстСообщения);
	
КонецПроцедуры



&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
    ТекстСообщения = "Изменена цена";
    ПересчитатьСумму(ТекДанные, ТекстСообщения)
    
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Пересчитать сумму.
// 
// Параметры:
//  СтрокаТЧ - ДанныеФормыЭлементКоллекции - Строка табличной части которая будет пересчитана
//  ТекстСообщения - Строка - Текст сообщения для отображения пользователю
&НаКлиенте
Процедура ПересчитатьСумму(СтрокаТЧ, Знач ТекстСообщения)
	
	
	
	Перем Сообщение;
	СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = (ТекстСообщения);
	Сообщение.Сообщить();
	
КонецПроцедуры

#КонецОбласти
